#Задание 3

proc = int(input('Введите количество процентов: '))
if proc == 1:
    print(f'{proc} процент')
elif proc == 21:
    print(f'{proc} процент')
elif proc == 31:
    print(f'{proc} процент')
elif proc == 41:
    print(f'{proc} процент')
elif proc == 51:
    print(f'{proc} процент')
elif proc == 61:
    print(f'{proc} процент')
elif proc == 71:
    print(f'{proc} процент')
elif proc == 81:
    print(f'{proc} процент')
elif proc == 91:
    print(f'{proc} процент')
elif 1 < proc < 5:
    print(f'{proc} процента')
elif 21 < proc < 25:
    print(f'{proc} процента')
elif 31 < proc < 35:
    print(f'{proc} процента')
elif 41 < proc < 45:
    print(f'{proc} процента')
elif 51 < proc < 55:
    print(f'{proc} процента')
elif 61 < proc < 65:
    print(f'{proc} процента')
elif 71 < proc < 75:
    print(f'{proc} процента')
elif 81 < proc < 85:
    print(f'{proc} процента')
elif 91 < proc < 95:
    print(f'{proc} процента')
elif 4 < proc < 21:
    print(f'{proc} процентов')
elif 24 < proc < 31:
    print(f'{proc} процентов')
elif 34 < proc < 41:
    print(f'{proc} процентов')
elif 44 < proc < 51:
    print(f'{proc} процентов')
elif 54 < proc < 61:
    print(f'{proc} процентов')
elif 64 < proc < 71:
    print(f'{proc} процентов')
elif 74 < proc < 81:
    print(f'{proc} процентов')
elif 84 < proc < 91:
    print(f'{proc} процентов')
elif 94 < proc < 101:
    print(f'{proc} процентов')
elif 24 < proc < 31:
    print(f'{proc} процентов')
elif 34 < proc < 41:
    print(f'{proc} процентов')
elif 44 < proc < 51:
    print(f'{proc} процентов')
elif 54 < proc < 61:
    print(f'{proc} процентов')
elif 64 < proc < 71:
    print(f'{proc} процентов')
elif 74 < proc < 81:
    print(f'{proc} процентов')
elif 84 < proc < 91:
    print(f'{proc} процентов')
elif 94 < proc < 101:
    print(f'{proc} процентов')